[
  {
    "id": "Q1.1",
    "dimensi": "Keterjangkauan (Affordability)",
    "skenario": "Anda mewajibkan siswa menonton video materi pengayaan di rumah. Namun, 5 orang tua siswa melapor bahwa mereka tidak sanggup membeli kuota data tambahan bulan ini.",
    "pertanyaan": "Langkah konkret apa yang Anda ambil agar semua siswa tetap bisa belajar?",
    "opsi": {
      "A": "Tetap mewajibkan karena pendidikan butuh modal dan siswa harus berusaha.",
      "B": "Strategi Pembedaan: Siswa punya kuota nonton di rumah, siswa tak punya kuota nonton di perpustakaan sekolah secara luring atau offline saat istirahat.",
      "C": "Membatalkan tugas video untuk semua siswa agar adil bagi yang tidak mampu.",
      "D": "Meminta siswa menumpang WiFi tetangga atau pergi ke balai desa untuk download."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 2,
      "D": 3
    }
  },
  {
    "id": "Q1.2",
    "dimensi": "Keterjangkauan (Affordability)",
    "skenario": "Sekolah mendapat bantuan tablet tapi jumlahnya terbatas (1 tablet untuk 3 siswa). Anda ingin menggunakan aplikasi matematika.",
    "pertanyaan": "Bagaimana Anda mengatur penggunaan tablet tersebut secara adil?",
    "opsi": {
      "A": "Aplikasi tidak jadi dipakai karena jumlah tablet kurang memadai untuk seluruh siswa.",
      "B": "Pilih aplikasi yang bisa dipakai bersama secara offline, rancang pembelajaran sistem rotasi agar semua dapat giliran.",
      "C": "Minta siswa yang memiliki HP sendiri untuk membawanya agar menutupi kekurangan tablet.",
      "D": "Hanya siswa dengan peringkat 1-10 yang diizinkan menggunakan tablet sebagai reward."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q1.3",
    "dimensi": "Keterjangkauan (Affordability)",
    "skenario": "Anda menemukan modul digital (PDF) sangat bagus tapi berbayar mahal. Sekolah tidak ada anggaran.",
    "pertanyaan": "Apa langkah yang akan Anda ambil untuk mengatasi masalah tersebut?",
    "opsi": {
      "A": "Membeli secara pribadi, lalu menjual hasil fotokopi modul tersebut kepada siswa.",
      "B": "Mencari versi bajakan di internet agar tidak perlu mengeluarkan biaya sama sekali.",
      "C": "Cari Sumber Belajar Terbuka (gratis) berlisensi resmi, adaptasi sesuai kebutuhan.",
      "D": "Hanya mengeluh tentang fasilitas yang minim tanpa mencari solusi alternatif lain."
    },
    "poin": {
      "A": 1,
      "B": 3,
      "C": 5,
      "D": 2
    }
  },
  {
    "id": "Q1.4",
    "dimensi": "Keterjangkauan (Affordability)",
    "skenario": "Anda menyiapkan Presentasi interaktif, tapi proyektor sekolah ternyata dipakai guru lain dan baru kosong 2 jam lagi.",
    "pertanyaan": "Apa yang akan Anda lakukan untuk mengisi jam pelajaran tersebut?",
    "opsi": {
      "A": "Ubah strategi jadi diskusi kelompok pakai laptop Anda sebagai pusat informasi bergilir.",
      "B": "Membatalkan pelajaran interaktif dan kembali mencatat materi dari buku paket saja.",
      "C": "Marah kepada guru yang sedang memakai proyektor karena mengganggu jadwal Anda.",
      "D": "Menunggu di kelas sampai proyektor kosong meskipun harus membuang waktu pelajaran."
    },
    "poin": {
      "A": 5,
      "B": 1,
      "C": 2,
      "D": 3
    }
  },
  {
    "id": "Q1.5",
    "dimensi": "Keterjangkauan (Affordability)",
    "skenario": "Grup WA dipakai untuk info PR. Sebagian orang tua gaptek/HP jadul (tak punya WA) sehingga anak ketinggalan info.",
    "pertanyaan": "Bagaimana cara Anda memastikan informasi sampai ke semua orang tua?",
    "opsi": {
      "A": "Mewajibkan semua orang tua untuk segera membeli HP Android agar bisa akses WA.",
      "B": "Membiarkan saja, karena itu adalah tanggung jawab orang tua untuk mencari informasi.",
      "C": "Info di WA tetap jalan, tapi buat juga Papan Info PR fisik di gerbang atau tempel stiker di buku siswa.",
      "D": "Meminta ketua kelas untuk menelepon teman-temannya satu per satu setiap sore."
    },
    "poin": {
      "A": 1,
      "B": 2,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q2.1",
    "dimensi": "Inklusi Budaya (Cultural Inclusion)",
    "skenario": "Video dari pemerintah mencontohkan proyek 'Pasar Sekolah' jualan Sandwich dan Burger. Siswa desa Anda asing dengan makanan itu.",
    "pertanyaan": "Bagaimana Anda menyesuaikan materi tersebut dengan kondisi siswa?",
    "opsi": {
      "A": "Memaksa siswa membuat Sandwich agar mereka mengenal budaya makanan modern/barat.",
      "B": "Ambil konsep 'Pasar Sekolah' (jual beli), tapi ganti produk jadi jajanan pasar lokal seperti getuk atau tiwul.",
      "C": "Membatalkan proyek tersebut karena dianggap terlalu sulit dan tidak relevan.",
      "D": "Hanya menjelaskan teori tentang Sandwich di kelas tanpa melakukan praktek langsung."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 1,
      "D": 3
    }
  },
  {
    "id": "Q2.2",
    "dimensi": "Inklusi Budaya (Cultural Inclusion)",
    "skenario": "Permainan edukasi matematika di tablet berbahasa Inggris ('Next', 'Submit'). Siswa kelas rendah bingung.",
    "pertanyaan": "Apa yang akan Anda lakukan untuk membantu siswa memahami aplikasi tersebut?",
    "opsi": {
      "A": "Melarang penggunaan permainan itu karena bahasanya sulit dipahami siswa.",
      "B": "Buat poster Kamus Kecil ikon tombol dan arti Indonesia di dinding, pandu di awal.",
      "C": "Menerjemahkan instruksi secara lisan satu per satu kepada setiap siswa (melelahkan).",
      "D": "Menyuruh siswa menebak-nebak sendiri arti tombolnya tanpa bantuan guru."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q2.3",
    "dimensi": "Inklusi Budaya (Cultural Inclusion)",
    "skenario": "Ingin ajar lagu daerah. Di YouTube banyak versi remix DJ/Koplo yang menghilangkan estetika asli.",
    "pertanyaan": "Video seperti apa yang akan Anda pilih untuk diputar di kelas?",
    "opsi": {
      "A": "Memutar versi remix DJ agar suasana kelas menjadi lebih semangat dan meriah.",
      "B": "Luangkan waktu cari video versi asli atau tradisional berkualitas untuk tanamkan apresiasi benar.",
      "C": "Menyuruh siswa mencari sendiri video yang mereka sukai di HP masing-masing.",
      "D": "Tidak menggunakan video sama sekali, cukup bernyanyi manual bersama-sama."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q2.4",
    "dimensi": "Inklusi Budaya (Cultural Inclusion)",
    "skenario": "Siswa memotret guru diam-diam di kelas dijadikan stiker WA. Di budaya setempat ini sangat tidak sopan.",
    "pertanyaan": "Tindakan apa yang akan Anda ambil terhadap siswa tersebut?",
    "opsi": {
      "A": "Menyita HP siswa tersebut dan memanggil polisi untuk memberikan efek jera.",
      "B": "Bahas kasus di kelas tanpa sebut nama sebagai studi kasus Privasi dan Adat, buat kesepakatan kelas.",
      "C": "Membiarkan saja tindakan tersebut agar guru terlihat gaul dan dekat dengan siswa.",
      "D": "Melaporkan kejadian ini kepada Kepala Sekolah dan meminta agar siswa diskors."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q2.5",
    "dimensi": "Inklusi Budaya (Cultural Inclusion)",
    "skenario": "Tugas kliping budaya biasanya cuma salin-tempel (copy-paste) gambar internet. Anda ingin lebih bermakna.",
    "pertanyaan": "Bentuk penugasan seperti apa yang akan Anda berikan?",
    "opsi": {
      "A": "Menerima tugas salin-tempel atau copy-paste asalkan tata letaknya rapi dan bersih.",
      "B": "Minta siswa potret tradisi sekitar rumah pakai HP ortu, unggah ke galeri kelas dengan cerita sendiri.",
      "C": "Mewajibkan siswa menggambar tangan saja agar tidak perlu menggunakan internet.",
      "D": "Menyuruh siswa pergi ke warnet untuk mencari gambar yang berbeda dari teman."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q3.1",
    "dimensi": "Kesejahteraan & Keamanan (Wellbeing & Safety)",
    "skenario": "Ortu sering tanya PR di WA jam 10 malam. Mengganggu istirahat.",
    "pertanyaan": "Bagaimana Anda merespon situasi ini tanpa mengurangi profesionalisme?",
    "opsi": {
      "A": "Tulis aturan Jam Respon (07.00-16.00) di deskripsi grup, bisukan atau mute notifikasi di luar jam itu.",
      "B": "Terus membalas pesan kapan saja agar dianggap sebagai guru teladan yang berdedikasi.",
      "C": "Marah-marah di grup karena merasa waktu istirahat Anda terganggu oleh orang tua.",
      "D": "Keluar dari grup WhatsApp kelas agar tidak perlu membaca keluhan orang tua."
    },
    "poin": {
      "A": 5,
      "B": 2,
      "C": 1,
      "D": 3
    }
  },
  {
    "id": "Q3.2",
    "dimensi": "Kesejahteraan & Keamanan (Wellbeing & Safety)",
    "skenario": "Rekan guru tempel kata sandi (password) akun belajar.id di monitor lab umum.",
    "pertanyaan": "Apa yang akan Anda katakan atau lakukan kepada rekan guru tersebut?",
    "opsi": {
      "A": "Bersikap masa bodoh karena keamanan akun adalah urusan masing-masing guru.",
      "B": "Ikut mencatat password tersebut untuk berjaga-jaga jika dibutuhkan nanti.",
      "C": "Tegur halus personal, jelaskan bahaya data bocor, sarankan cara aman.",
      "D": "Melaporkan kelalaian tersebut kepada operator sekolah agar rekan itu ditegur."
    },
    "poin": {
      "A": 1,
      "B": 2,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q3.3",
    "dimensi": "Kesejahteraan & Keamanan (Wellbeing & Safety)",
    "skenario": "Stres (kelelahan mental) dikejar sertifikat pelatihan online dan tugas mengajar padat.",
    "pertanyaan": "Langkah apa yang paling sehat untuk mengelola beban kerja Anda?",
    "opsi": {
      "A": "Membayar jasa joki untuk mengerjakan sertifikat agar Anda tidak perlu repot.",
      "B": "Mengabaikan persiapan mengajar di kelas demi mengejar target sertifikat PMM.",
      "C": "Jadwalkan waktu khusus pelatihan (misal Sabtu), fokus penuh mengajar di jam sekolah.",
      "D": "Terus-menerus mengeluh tentang beban kerja di status WhatsApp pribadi."
    },
    "poin": {
      "A": 2,
      "B": 1,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q3.4",
    "dimensi": "Kesejahteraan & Keamanan (Wellbeing & Safety)",
    "skenario": "Siswa sering mengantuk di kelas karena main game online sampai subuh.",
    "pertanyaan": "Pendekatan apa yang akan Anda lakukan kepada siswa dan orang tuanya?",
    "opsi": {
      "A": "Memarahi siswa tersebut setiap kali terlihat mengantuk di dalam kelas.",
      "B": "Undang ortu diskusi, ajarkan Fitur Pengawasan Orang Tua di HP, buat kesepakatan dengan siswa.",
      "C": "Membiarkan siswa tidur di kelas karena kasihan dia kurang istirahat.",
      "D": "Menyita HP siswa selamanya agar dia tidak bisa bermain game lagi."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 2,
      "D": 3
    }
  },
  {
    "id": "Q3.5",
    "dimensi": "Kesejahteraan & Keamanan (Wellbeing & Safety)",
    "skenario": "Beredar berita bohong (hoax) penculikan anak di grup WA ortu, bikin panik.",
    "pertanyaan": "Tindakan apa yang akan Anda lakukan di grup tersebut?",
    "opsi": {
      "A": "Ikut menyebarkan informasi tersebut agar semua orang tua waspada.",
      "B": "Diam saja dan tidak peduli, karena itu urusan orang tua murid.",
      "C": "Cari klarifikasi resmi (Cek Fakta), posting info benar dengan bahasa menenangkan.",
      "D": "Langsung menghapus pesan tersebut tanpa memberikan penjelasan apapun."
    },
    "poin": {
      "A": 1,
      "B": 2,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q4.1",
    "dimensi": "Kemandirian Guru (Empowered Agency)",
    "skenario": "Anda menemukan metode seru Kuis Mode Kertas (tanpa perangkat siswa). Rekan lain malas coba.",
    "pertanyaan": "Bagaimana cara Anda mengajak rekan guru lain untuk mencobanya?",
    "opsi": {
      "A": "Menggunakannya sendiri secara diam-diam agar kelas Anda terlihat paling unggul.",
      "B": "Ajak rekan lihat kelas Anda saat main (bukti antusiasme siswa), baru tawarkan bantuan.",
      "C": "Menyindir guru lain yang gaptek agar mereka merasa malu dan mau belajar.",
      "D": "Memaksa Kepala Sekolah untuk mewajibkan semua guru memakai metode ini."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 1,
      "D": 3
    }
  },
  {
    "id": "Q4.2",
    "dimensi": "Kemandirian Guru (Empowered Agency)",
    "skenario": "Buku TIK ajar cara pakai disket (usang).",
    "pertanyaan": "Apa keputusan Anda terkait materi ajar tersebut?",
    "opsi": {
      "A": "Tetap mengajar sesuai buku paket agar administrasi aman dan tidak repot.",
      "B": "Jelaskan sejarah disket sekilas, lompat ajar penyimpanan awan (Cloud) atau Flashdisk (relevan).",
      "C": "Tidak mengajarkan bab itu sama sekali karena dianggap membuang waktu.",
      "D": "Menyuruh siswa mencari informasi sendiri di internet tentang materi tersebut."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q4.3",
    "dimensi": "Kemandirian Guru (Empowered Agency)",
    "skenario": "Dinas jarang adakan pelatihan TIK. Keterampilan stagnan.",
    "pertanyaan": "Apa inisiatif Anda untuk tetap meningkatkan kompetensi diri?",
    "opsi": {
      "A": "Pasrah menunggu undangan pelatihan dari dinas pendidikan datang sendiri.",
      "B": "Cari webinar gratis YouTube/PMM, gabung komunitas, praktek 1 ilmu baru per minggu.",
      "C": "Hanya mengeluh kepada rekan sejawat tentang minimnya kesempatan pengembangan diri.",
      "D": "Meminta diajarkan teman tapi tidak pernah dicoba dipraktekkan sendiri."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q4.4",
    "dimensi": "Kemandirian Guru (Empowered Agency)",
    "skenario": "WiFi sekolah lemot saat jam sibuk. KS acuh.",
    "pertanyaan": "Langkah konstruktif apa yang akan Anda usulkan ke Kepala Sekolah?",
    "opsi": {
      "A": "Marah-marah kepada penjaga sekolah setiap kali internet terasa lambat.",
      "B": "Catat jam macet, usul jadwal penggunaan bergilir per jenjang, ajukan ke KS.",
      "C": "Selalu menggunakan kuota data pribadi agar pekerjaan cepat selesai.",
      "D": "Berhenti menggunakan internet di sekolah dan kembali ke cara manual sepenuhnya."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q4.5",
    "dimensi": "Kemandirian Guru (Empowered Agency)",
    "skenario": "Ingin buat video profil sekolah tapi tak bisa edit.",
    "pertanyaan": "Solusi kreatif apa yang akan Anda tempuh untuk menyelesaikan video ini?",
    "opsi": {
      "A": "Membatalkan pembuatan video profil sekolah karena merasa tidak mampu.",
      "B": "Jadi sutradara, rekrut siswa jago ngedit HP jadi tim teknis. Belajar dari siswa.",
      "C": "Membayar jasa profesional untuk membuatkan video agar hasilnya bagus.",
      "D": "Menunda pembuatan video sampai Anda belajar mengedit selama setahun."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 2,
      "D": 3
    }
  }
]
